S1/background/system/pointLocation2.txt
( 3.156 -0.340 0.000 )
( 3.136 -0.340 0.032 )
( 3.117 -0.340 0.063 )
( 3.098 -0.340 0.095 )
( 3.079 -0.340 0.127 )
( 3.060 -0.340 0.159 )
( 3.041 -0.340 0.191 )
( 3.022 -0.340 0.223 )
( 3.003 -0.340 0.255 )
( 2.985 -0.340 0.288 )
( 2.967 -0.340 0.320 )
( 2.948 -0.340 0.353 )
( 2.930 -0.340 0.385 )
( 2.912 -0.340 0.418 )
( 2.895 -0.340 0.450 )
( 2.877 -0.340 0.483 )
