S1/background/system/pointLocation3.txt
( 2.294 0.340 0.000 )
( 2.314 0.340 0.032 )
( 2.333 0.340 0.063 )
( 2.352 0.340 0.095 )
( 2.371 0.340 0.127 )
( 2.390 0.340 0.159 )
( 2.409 0.340 0.191 )
( 2.428 0.340 0.223 )
( 2.447 0.340 0.255 )
( 2.465 0.340 0.288 )
( 2.483 0.340 0.320 )
( 2.502 0.340 0.353 )
( 2.520 0.340 0.385 )
( 2.538 0.340 0.418 )
( 2.555 0.340 0.450 )
( 2.573 0.340 0.483 )
